export const 아이콘_코드 = {
  CARROT: 'f787',
  CART: 'f07a',
  USER: 'f007',
  DELETE: 'f2ed',
  ALERT: 'f06a',
  RECEIPT: 'f543',
};

export const 비동기_요청 = {
  SUCCESS: '비동기_요청_성공',
  FAILURE: '비동기_요청_실패',
};

export const 숫자 = {
  최소_주문수량: 1,
  최대_주문수량: 99,
};

export const 알림_메시지 = {
  권한_없음: '❌ 로그인이 필요한 기능입니다',
  장바구니_추가: (name) => `${name}가 장바구니에 추가되었습니다 🧺`,
  장바구니_추가_중복: '이미 장바구니에 담긴 상품입니다 🙌',
  장바구니_추가_오류: '추가에 실패했습니다. 잠시 후 다시 시도해주세요 😥',
  장바구니_개별_삭제: (name) => `${name}를 장바구니에서 삭제하였습니다 🧺`,
  장바구니_다중_삭제: '삭제했습니다! 다음에 구매해주세요 😊',
  장바구니_삭제_실패: '삭제에 실패했습니다. 잠시 후 다시 시도해주세요 😥',
  상품_주문_성공: '상품을 주문하였습니다!',
  상품_주문_실패: '상품 주문에 실패하였습니다.  잠시 후 다시 시도해주세요 😥',
};
