export const 아이콘_코드 = {
  CARROT: 'f787',
  CART: 'f07a',
  USER: 'f007',
  DELETE: 'f2ed',
  ALERT: 'f06a',
  RECEIPT: 'f543',
  LOGOUT: 'f2f5',
};

export const 비동기_요청 = {
  SUCCESS: '비동기_요청_성공',
  FAILURE: '비동기_요청_실패',
};

export const 숫자 = {
  최소_주문수량: 1,
  최대_주문수량: 99,
};

export const 알림_메시지 = {
  권한_없음: '❌ 로그인이 필요한 기능입니다',
  장바구니_추가: (name) => `${name}가 장바구니에 추가되었습니다 🧺`,
  장바구니_추가_중복: '이미 장바구니에 담긴 상품입니다 🙌',
  장바구니_추가_오류: '추가에 실패했습니다. 잠시 후 다시 시도해주세요 😥',
  장바구니_개별_삭제: (name) => `${name}를 장바구니에서 삭제하였습니다 🧺`,
  장바구니_다중_삭제: '삭제했습니다! 다음에 구매해주세요 😊',
  장바구니_삭제_실패: '삭제에 실패했습니다. 잠시 후 다시 시도해주세요 😥',
  상품_주문_성공: '상품을 주문하였습니다!',
  상품_주문_실패: '상품 주문에 실패하였습니다.  잠시 후 다시 시도해주세요 😥',
  불완전한_로그인_입력: '아이디와 비밀번호를 모두 입력해주세요!',
  잘못된_비밀번호: '비밀번호가 올바르지 않습니다. 다시 시도해주세요!',
  회원_정보_수정_성공: '회원 정보가 수정되었습니다!',
  회원_정보_수정_실패: '회원 정보가 수정되었습니다!',
  비밀번호_수정_성공: '비밀번호가 수정 되었습니다!',
  비밀번호_수정_실패: '비밀번호가 수정에 실패 하였습니다!',
  회원_탈퇴_확인: '정말로 탈퇴 하실 건가요? 한 번 탈퇴하면 되돌릴 수 없어요 😭',
  회원_탈퇴_성공: '회원 탈퇴에 성공하였습니다!',
  회원_탈퇴_실패: '회원 탈퇴에 실패하였습니다.',
  아이디_중복_확인_성공: '사용가능한 아이디입니다!',
  아이디_중복_확인_실패: '중복된 아이디입니다!',
  회원가입_성공: '회원가입에 성공하였습니다!',
  회원가입_실패: '회원가입에 실패하였습니다!',
  로그인_성공: '로그인에 성공하였습니다',
  로그인_실패: '로그인에 실패하였습니다 😭',
  로그아웃: '로그아웃 되었습니다. 다음에 또 만나요 😊',
};
